app/controllers/items_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def edit
    if @item.user != current_user
      return
    end

    @item = Item.find(params[:id])