app/controllers/items_controller.rb

INSERT INTO "items" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "category", "condition", "created_at", "deposit", "description", "location", "rental_price", "schedule_from", "schedule_to", "title", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])
    @item.user = current_user

    if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "location" = 'Mountain View 2', "updated_at" = '2012-07-07 06:26:15.264835' WHERE "items"."id" = 1
UPDATE "users" SET "last_request_at" = '2012-07-03 07:57:19.426393', "updated_at" = '2012-07-03 07:57:19.426795' WHERE "users"."id" = 2
---
  def update
    @item = Item.find(params[:id])

	@item.user = current_user
    respond_to do |format|
      if @item.update_attributes(params[:item])