app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save
---
INSERT INTO "users" ("address", "created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login", "login_count", "password_salt", "persistence_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id]) # makes our views "cleaner" and more consistent

    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "password_salt" = 'SaxNFgPo6unuCJAMar1x', "crypted_password" = '5854af7c5a29c976d1033f48e285f91857f25558e8f09e162fa35952ff94176b737976d2a518f523c183343c1f8dec2c825c6d9fe29014de0abdb567056bd24f', "persistence_token" = '457024fa5450a900f3ad912af5819880f8803c531b8433673177e619ee5725ced754fd8f8ec03da69803db23088b32e4ec81ec509d24d0eb302568a996b020ca', "address" = 'Mountain View', "last_request_at" = '2012-07-07 05:37:11.878310', "login_count" = 2, "last_login_at" = '2012-07-07 05:22:11.072979', "current_login_at" = '2012-07-07 05:37:11.878095', "last_login_ip" = '127.0.0.1', "updated_at" = '2012-07-07 05:37:11.878658' WHERE "users"."id" = 2